package com.example.musicapp.wave;

public interface ViolinCoefficients {
    //32 начальных фаз в градусах из таблицы
     double[] initialPhaseCoefficients = {
            -10.47,  -22.87, 174.82, -113.37,   31.67, -97.76, -147.28, 167.50,
             60.95, -133.69, -81.50, -153.50,   25.63, -60.95,  -37.05,  24.03,
             64.57,   52.95, 109.83, -150.09, -167.28,  81.16, -134.89, -52.63,
            -37.29,  136.04, 114.37, -117.72, -110.30, -18.51, -153.00, -89.79};

    //32 значение амплитуды для гармоник
    int[] amplitudeRatios = {
            100, 825, 896, 360, 522, 309, 20, 388,
            191, 612, 610, 255, 168, 131, 46,  56,
            56, 74, 132,  30,  80,  30, 68,  22,
            43, 16,  20,  16,   7,   6,  6,   5};
}
